# Homebrew Bundle File
# Install with: brew bundle --file=Brewfile

# Development tools
brew "arduino-cli"
brew "awscli"
brew "azure-cli"
brew "git"
brew "git-lfs"
brew "git-xet"
brew "huggingface-cli"
brew "platformio"
brew "python"

# System utilities
brew "fswatch"
brew "jq"
brew "nmap"
brew "npm"
brew "rsync"
brew "telnet"
brew "tree"
brew "zsh"

# Python package manager
cask "miniconda"

# Main apps
cask "bitwarden"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"