# Homebrew Bundle File
# Install with: brew bundle --file=Brewfile

# Main apps
cask "bitwarden"
cask "google-chrome"
cask "keepingyouawake"
cask "spotify"
cask "visual-studio-code"

# Development tools
brew "arduino-cli"
brew "awscli"
brew "azure-cli"
brew "git-lfs"
brew "git-xet"
brew "git"
brew "huggingface-cli"
brew "platformio"
brew "vim"
cask "codex"

# System utilities
brew "coreutils"
brew "fswatch"
brew "jq"
brew "nmap"
brew "npm"
brew "rsync"
brew "telnet"
brew "tree"
brew "wget"
brew "zsh"

# Python
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
cask "miniconda"

# VSCode extensions
vscode "platformio.platformio-ide"
